tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    maxX
    {
        type            zeroGradient;
    }
    minY
    {
        type            zeroGradient;
    }
    maxY
    {
        type            zeroGradient;
    }
    minZ
    {
        type            zeroGradient;
    }
    maxZ
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
